results/cpu-vs-latency5/memcached/2-1/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2351466 ops,   79545 (avg:   78381) ops/sec, 3.00MB/sec (avg: 2.96MB/sec),  0.40 (avg:  0.41) msec latency

2         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7126.11          ---          ---      0.40800       528.24
Gets       71255.88     28462.76     42793.12      0.40500      2498.70
Totals     78382.00     28462.76     42793.12      0.40500      3026.94


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.067      0.00005
GET       0.068      0.00019
GET       0.073      0.00023
GET       0.074      0.00033
GET       0.075      0.00042
GET       0.076      0.00065
GET       0.077      0.00098
GET       0.078      0.00117
GET       0.079      0.00140
GET       0.080      0.00164
GET       0.081      0.00192
GET       0.082      0.00211
GET       0.083      0.00262
GET       0.084      0.00327
GET       0.085      0.00407
GET       0.086      0.00519
GET       0.087      0.00632
GET       0.088      0.00786
GET       0.089      0.00954
GET       0.090      0.01118
GET       0.091      0.01361
GET       0.092      0.01605
GET       0.093      0.02030
GET       0.094      0.02489
GET       0.095      0.03008
GET       0.096      0.03532
GET       0.097      0.04028
GET       0.098      0.04697
GET       0.099      0.05487
GET       0.100      0.09856
GET       0.110      0.24073
GET       0.120      0.49236
GET       0.130      1.02054
GET       0.140      2.28088
GET       0.150      4.21457
GET       0.160      5.95495
GET       0.170      7.53503
GET       0.180      9.14561
GET       0.190     11.29237
GET       0.200     13.32724
GET       0.210     14.71655
GET       0.220     15.79837
GET       0.230     16.87337
GET       0.240     18.33542
GET       0.250     20.08882
GET       0.260     22.03560
GET       0.270     24.28939
GET       0.280     27.12274
GET       0.290     30.90450
GET       0.300     35.19452
GET       0.310     39.60711
GET       0.320     44.07494
GET       0.330     48.73218
GET       0.340     53.68399
GET       0.350     58.17909
GET       0.360     61.85555
GET       0.370     64.80412
GET       0.380     67.15835
GET       0.390     69.03164
GET       0.400     70.40205
GET       0.410     71.38920
GET       0.420     72.13992
GET       0.430     72.75731
GET       0.440     73.34585
GET       0.450     73.93027
GET       0.460     74.55913
GET       0.470     75.23200
GET       0.480     75.97145
GET       0.490     76.78972
GET       0.500     77.63905
GET       0.510     78.51607
GET       0.520     79.39979
GET       0.530     80.29833
GET       0.540     81.19617
GET       0.550     82.07554
GET       0.560     82.92828
GET       0.570     83.76386
GET       0.580     84.57521
GET       0.590     85.34473
GET       0.600     86.08965
GET       0.610     86.78835
GET       0.620     87.45113
GET       0.630     88.09874
GET       0.640     88.70239
GET       0.650     89.28442
GET       0.660     89.84835
GET       0.670     90.38225
GET       0.680     90.90108
GET       0.690     91.39671
GET       0.700     91.86825
GET       0.710     92.29895
GET       0.720     92.67885
GET       0.730     93.02908
GET       0.740     93.33521
GET       0.750     93.59128
GET       0.760     93.80343
GET       0.770     93.98030
GET       0.780     94.12569
GET       0.790     94.24362
GET       0.800     94.33859
GET       0.810     94.41680
GET       0.820     94.48024
GET       0.830     94.53632
GET       0.840     94.58703
GET       0.850     94.63681
GET       0.860     94.68228
GET       0.870     94.73149
GET       0.880     94.78108
GET       0.890     94.83670
GET       0.900     94.89723
GET       0.910     94.95659
GET       0.920     95.02096
GET       0.930     95.08926
GET       0.940     95.16303
GET       0.950     95.24045
GET       0.960     95.31857
GET       0.970     95.39735
GET       0.980     95.47805
GET       0.990     95.55846
GET       1.000     96.00885
GET       1.100     96.82708
GET       1.200     97.78386
GET       1.300     98.86990
GET       1.400     99.59868
GET       1.500     99.81733
GET       1.600     99.85980
GET       1.700     99.86939
GET       1.800     99.87313
GET       1.900     99.87809
GET       2.000     99.89283
GET       2.100     99.91701
GET       2.200     99.94742
GET       2.300     99.97114
GET       2.400     99.98737
GET       2.500     99.99644
GET       2.600     99.99864
GET       2.700     99.99967
GET       2.800     99.99986
GET       3.100     99.99995
GET       3.200    100.00000